     A*================================================================
     A* ファイル名: CLASSL1
     A* 説明      : クラス論理ファイル（クラス名順）
     A* 基礎PF    : CLASSPF
     A* 作成日    : 2026/03/14
     A* 作成者    : システム開発部
     A*================================================================
     A          R CLSREC                     PFILE(CLASSPF)
     A*
     A*   --- アクセスパス: クラス名順 ---
     A          K CLSNAM
     A          K CLSID
