     A*================================================================
     A* ファイル名: SCHOOLL1
     A* 説明      : 学校論理ファイル（学校名順）
     A* 基礎PF    : SCHOOLPF
     A* 作成日    : 2026/03/14
     A* 作成者    : システム開発部
     A*================================================================
     A          R SCLREC                     PFILE(SCHOOLPF)
     A*
     A*   --- アクセスパス: 学校名順 ---
     A          K SCLNAM
     A          K SCLID
