     A*================================================================
     A* ファイル名: STUDNTL1
     A* 説明      : 学生論理ファイル（氏名順）
     A* 基礎PF    : STUDNTPF
     A* 作成日    : 2026/03/14
     A* 作成者    : システム開発部
     A*================================================================
     A          R STUREC                     PFILE(STUDNTPF)
     A*
     A*   --- アクセスパス: 氏名順 ---
     A          K STUNAM
     A          K STUID
