     A          R TITLE
     A                                      SPACEB(3)
     A                                 1 30'学 生 名 簿 一 覧 表'
     A                                      SPACEA(1)
     A            RPDATE         8S 0  1  1
     A                                      EDTCDE(Y)
     A                                 1 70'ページ:'
     A            RPPAGE         4S 0  1 78
