     H DFTACTGRP(*NO)
     D Counter         S              5  0
     C                   EVAL      Counter = 1
     C                   EVAL      *INLR = *ON
